# -*- fill-column: 69; org-confirm-babel-evaluate: nil -*-
#+STARTUP: noalign entitiespretty hidestars noindent showall
#+OPTIONS: prop:nil title:t toc:t \n:nil ::t |:t ^:{} -:t *:t ':nil
#+OPTIONS: prop:nil title:t toc:t \n:nil ::t |:t ^:{} -:t *:t ':nil

#+TITLE: LISP YANG Model
#+AUTHOR: Vina Ermagan
#+EMAIL: ermagan@gmail.com
#+AFFILIATION: Google
#+RFC_ADD_AUTHOR: ("Alberto Rodriguez-Natal" "natal@cisco.com" "Cisco Systems")
#+RFC_ADD_AUTHOR: ("Florin Coras" "fcoras@cisco.com" "Cisco Systems")
#+RFC_ADD_AUTHOR: ("Carl Moberg" "camoberg@cisco.com" "Cisco Systems")
#+RFC_ADD_AUTHOR: ("Reshad Rahman" "rrahman@cisco.com" "Cisco Systems")
#+RFC_ADD_AUTHOR: ("Albert Cabellos-Aparicio" "acabello@ac.upc.edu" "Technical University of Catalonia")
#+RFC_ADD_AUTHOR: ("Fabio Maino" "fmaino@cisco.com" "Cisco Systems")
#+RFC_NAME: draft-ietf-lisp-yang
#+RFC_VERSION: 12
#+RFC_XML_VERSION: 2

#+begin_abstract
This document describes a YANG data model to use with the Locator/ID Separation
Protocol (LISP). The YANG modules in this document conform to the Network
Management Datastore Architecture (NMDA).
#+end_abstract

** Module Structure

#+NAME: LISP Module YANG tree diagram.
#+begin_src bash :var file=ietf-lisp :results output verbatim replace :wrap example :exports results
  pyang -f tree ${file}
#+end_src

#+RESULTS: LISP Module YANG tree diagram.
#+begin_example
#+end_example

** LISP protocol instance

The following is an example configuration for a LISP protocol instance with the
name "LISP1". There are also 2 VNIs configured.

#+NAME: validate-xml-example
#+HEADER: :var vfile=xml-example :var module=ietf-lisp
#+begin_src bash :results output verbatim replace :wrap example :exports none
  mkdir -p .validate
  if ! yang2dsdl -x -t config -d .validate -v ${vfile} $module 2>&1 >/dev/null; then echo FAIL; fi
#+end_src

#+RESULTS: validate-xml-example
#+begin_example
Data model defines no data.
FAIL
#+end_example

#+CAPTION: Example Base LISP Module Use.
#+NAME: xml-example
#+begin_src xml :file test-xml-example.xml :results output code silent :exports code
<data xmlns="urn:ietf:params:xml:ns:netconf:base:1.0">
  <network-instances
     xmlns="urn:ietf:params:xml:ns:yang:ietf-network-instance">
    <network-instance>
      <name>VRF-BLUE</name>
      <vrf-root/>
      <enabled>true</enabled>
    </network-instance>
    <network-instance>
      <name>VRF-RED</name>
      <vrf-root/>
      <enabled>true</enabled>
    </network-instance>
  </network-instances>
  <routing xmlns="urn:ietf:params:xml:ns:yang:ietf-routing">
    <control-plane-protocols>
      <control-plane-protocol>
        <type xmlns:lisp="urn:ietf:params:xml:ns:yang:ietf-lisp">
          lisp:lisp
        </type>
        <name>LISP1</name>
        <lisp xmlns="urn:ietf:params:xml:ns:yang:ietf-lisp">
          <lisp-role>
            <lisp-role-type>etr</lisp-role-type>
          </lisp-role>
          <lisp-role>
            <lisp-role-type>itr</lisp-role-type>
          </lisp-role>
          <vpns>
            <vpn>
              <instance-id>1000</instance-id>
              <iid-name>VRF-BLUE</iid-name>
            </vpn>
            <vpn>
              <instance-id>2000</instance-id>
              <iid-name>VRF-RED</iid-name>
            </vpn>
          </vpns>
        </lisp>
      </control-plane-protocol>
    </control-plane-protocols>
  </routing>
</data>
#+end_src

** LISP ITR

The following is an example configuration for ITR functionality under "LISP1".
There are 2 Map-Resolvers configured.

#+NAME: validate-xml-example2
#+HEADER: :var vfile=xml-example2 :var module=ietf-lisp
#+begin_src bash :results output verbatim replace :wrap example :exports none
  mkdir -p .validate
  if ! yang2dsdl -x -t config -d .validate -v ${vfile} $module 2>&1 >/dev/null; then echo FAIL; fi
#+end_src

#+RESULTS: validate-xml-example2
#+begin_example
test-xml-example.xml validates
No errors found.
#+end_example

#+CAPTION: Example LISP-ITR Module Use.
#+NAME: xml-example2
#+begin_src xml :file test-xml-example2.xml :results output code silent :exports code
<config xmlns="urn:ietf:params:xml:ns:netconf:base:1.0">
  <routing xmlns="urn:ietf:params:xml:ns:yang:ietf-routing">
    <control-plane-protocols>
      <control-plane-protocol>
        <type xmlns:lisp="urn:ietf:params:xml:ns:yang:ietf-lisp">
          lisp:lisp
        </type>
        <name>LISP1</name>
        <lisp xmlns="urn:ietf:params:xml:ns:yang:ietf-lisp">
          <lisp-role>
            <lisp-role-type>itr</lisp-role-type>
          </lisp-role>
          <itr xmlns="urn:ietf:params:xml:ns:yang:ietf-lisp-itr">
            <map-resolvers>
              <map-resolver>2001:db8:203:0:113::1</map-resolver>
              <map-resolver>2001:db8:204:0:113::1</map-resolver>
            </map-resolvers>
          </itr>
        </lisp>
      </control-plane-protocol>
    </control-plane-protocols>
  </routing>
</config>
#+end_src

** LISP ETR

The following is an example configuration for ETR functionality under "LISP1".
There are 2 Map-Servers and 2 local EIDs configured.

#+NAME: validate-xml-example3
#+HEADER: :var vfile=xml-example3 :var module=ietf-lisp
#+begin_src bash :results output verbatim replace :wrap example :exports none
  mkdir -p .validate
  if ! yang2dsdl -x -t config -d .validate -v ${vfile} $module 2>&1 >/dev/null; then echo FAIL; fi
#+end_src

#+RESULTS: validate-xml-example3
#+begin_example
test-xml-example3.xml validates
No errors found.
#+end_example

#+CAPTION: Example LISP-ETR Module Use.
#+NAME: xml-example3
#+begin_src xml :file test-xml-example3.xml :results output code silent :exports code
<config xmlns="urn:ietf:params:xml:ns:netconf:base:1.0">
  <network-instances
     xmlns="urn:ietf:params:xml:ns:yang:ietf-network-instance">
    <network-instance>
      <name>VRF-BLUE</name>
      <vrf-root/>
      <enabled>true</enabled>
    </network-instance>
    <network-instance>
      <name>VRF-RED</name>
      <vrf-root/>
      <enabled>true</enabled>
    </network-instance>
  </network-instances>
  <routing xmlns="urn:ietf:params:xml:ns:yang:ietf-routing">
    <control-plane-protocols>
      <control-plane-protocol>
        <type xmlns:lisp="urn:ietf:params:xml:ns:yang:ietf-lisp">
          lisp:lisp
        </type>
        <name>LISP1</name>
        <lisp xmlns="urn:ietf:params:xml:ns:yang:ietf-lisp">
          <lisp-role>
            <lisp-role-type>etr</lisp-role-type>
          </lisp-role>
          <lisp-router-id>
           <site-id>1</site-id>
          </lisp-router-id>
          <vpns>
            <vpn>
              <instance-id>1000</instance-id>
              <iid-name>VRF-BLUE</iid-name>
            </vpn>
            <vpn>
              <instance-id>2000</instance-id>
              <iid-name>VRF-RED</iid-name>
            </vpn>
          </vpns>
          <etr xmlns="urn:ietf:params:xml:ns:yang:ietf-lisp-etr">
            <map-servers>
              <map-server>
                <ms-address>2001:db8:203:0:113::1</ms-address>
                <authentication-keys>
                  <authentication-key>
                    <auth-key-id>key1</auth-key-id>
                    <auth-algorithm-id>
                       hmac-sha-256-128
                     </auth-algorithm-id>
                    <auth-key-value>*Kye^$$1#gb91U04zpa</auth-key-value>
                  </authentication-key>
                </authentication-keys>
              </map-server>
              <map-server>
                <ms-address>2001:db8:204:0:113::1</ms-address>
                <authentication-keys>
                  <authentication-key>
                    <auth-key-id>key1</auth-key-id>
                    <auth-algorithm-id>
                       hmac-sha-256-128
                    </auth-algorithm-id>
                    <auth-key-value>*Kye^$$1#gb91U04zpa</auth-key-value>
                  </authentication-key>
                </authentication-keys>
              </map-server>
            </map-servers>
            <local-eids>
              <vpn>
                <instance-id>1000</instance-id>
                <eids>
                  <local-eid>
                    <id>2001:db8:400:0:100::0</id>
                    <eid-address>
                      <address-type xmlns:laddr=
                  "urn:ietf:params:xml:ns:yang:ietf-lisp-address-types">
                         laddr:ipv6-prefix-afi
                      </address-type>
                      <ipv6-prefix>2001:db8:400:0:100::/80</ipv6-prefix>
                    </eid-address>
                  </local-eid>
                </eids>
              </vpn>
              <vpn>
                <instance-id>2000</instance-id>
                <eids>
                  <local-eid>
                    <id>2001:db8:800:0:200::0</id>
                    <eid-address>
                      <address-type xmlns:laddr=
                  "urn:ietf:params:xml:ns:yang:ietf-lisp-address-types">
                         laddr:ipv6-prefix-afi
                       </address-type>
                      <ipv6-prefix>2001:db8:800:0:200::/80</ipv6-prefix>
                    </eid-address>
                  </local-eid>
                </eids>
              </vpn>
            </local-eids>
          </etr>
        </lisp>
      </control-plane-protocol>
    </control-plane-protocols>
  </routing>
</config>
#+end_src

** LISP Map-Server

The following is an example configuration for Map-Server functionality under
"LISP1". There are 2 mappings configured.

#+NAME: validate-xml-example4
#+HEADER: :var vfile=xml-example4 :var module=ietf-lisp
#+begin_src bash :results output verbatim replace :wrap example :exports none
  mkdir -p .validate
  if ! yang2dsdl -x -t config -d .validate -v ${vfile} $module 2>&1 >/dev/null; then echo FAIL; fi
#+end_src

#+RESULTS: validate-xml-example4
#+begin_example
test-xml-example4.xml validates
No errors found.
#+end_example

#+CAPTION: Example LISP-Map-Server Module Use.
#+NAME: xml-example4
#+begin_src xml :file test-xml-example4.xml :results output code silent :exports code
<config xmlns="http://tail-f.com/ns/config/1.0">
  <routing xmlns="urn:ietf:params:xml:ns:yang:ietf-routing">
    <control-plane-protocols>
      <control-plane-protocol>
        <type xmlns:lisp="urn:ietf:params:xml:ns:yang:ietf-lisp">
          lisp:lisp
        </type>
        <name>LISP1</name>
        <lisp xmlns="urn:ietf:params:xml:ns:yang:ietf-lisp">
          <lisp-role>
            <lisp-role-type xmlns:lisp-ms=
              "urn:ietf:params:xml:ns:yang:ietf-lisp-mapserver">
              lisp-ms:ms
            </lisp-role-type>
          </lisp-role>
          <map-server xmlns=
             "urn:ietf:params:xml:ns:yang:ietf-lisp-mapserver">
            <sites>
              <site>
                <site-id>1</site-id>
                <authentication-keys>
                  <authentication-key>
                    <auth-key-id>key1</auth-key-id>
                    <auth-algorithm-id>
                       hmac-sha-256-128
                    </auth-algorithm-id>
                    <auth-key-value>*Kye^$$1#gb91U04zpa</auth-key-value>
                  </authentication-key>
                </authentication-keys>
              </site>
            </sites>
            <vpns>
              <vpn>
                <instance-id>1000</instance-id>
                <mappings>
                  <mapping>
                    <eid-id>1</eid-id>
                    <eid-address>
                      <address-type xmlns:laddr=
                  "urn:ietf:params:xml:ns:yang:ietf-lisp-address-types">
                         laddr:ipv6-prefix-afi
                       </address-type>
                      <ipv6-prefix>2001:db8:400:0:100::/80</ipv6-prefix>
                    </eid-address>
                  </mapping>
                </mappings>
              </vpn>
              <vpn>
                <instance-id>2000</instance-id>
                <mappings>
                  <mapping>
                    <eid-id>1</eid-id>
                    <eid-address>
                      <address-type xmlns:laddr=
                  "urn:ietf:params:xml:ns:yang:ietf-lisp-address-types">
                         laddr:ipv6-prefix-afi
                      </address-type>
                      <ipv6-prefix>2001:db8:800:0:200::/80</ipv6-prefix>
                    </eid-address>
                  </mapping>
                </mappings>
              </vpn>
            </vpns>
          </map-server>
        </lisp>
      </control-plane-protocol>
    </control-plane-protocols>
  </routing>
</config>
#+end_src

